<template>
  <div id="app">
    <ve-scatter :data="chartData" :settings="chartSettings"></ve-scatter>
  </div>
</template>

<script>
import VeScatter from '../../../../lib/scatter'

export default {
  created: function () {
    this.chartData = {
      columns: ['日期', '余额', '数量', '年龄'],
      rows: {
        '上海': [
          { '日期': '1-1', '余额': 123, '年龄': 3, '数量': 1244 },
          { '日期': '1-2', '余额': 1223, '年龄': 6, '数量': 2344 },
          { '日期': '1-3', '余额': 7123, '年龄': 9, '数量': 3245 },
          { '日期': '1-4', '余额': 4123, '年龄': 12, '数量': 4355 },
          { '日期': '1-5', '余额': 3123, '年龄': 15, '数量': 4564 },
          { '日期': '1-6', '余额': 2323, '年龄': 20, '数量': 6537 }
        ],
        '北京': [
          { '日期': '1-1', '余额': 123, '年龄': 3, '数量': 1244 },
          { '日期': '1-2', '余额': 1273, '年龄': 6, '数量': 2344 },
          { '日期': '1-3', '余额': 3123, '年龄': 15, '数量': 4564 },
          { '日期': '1-4', '余额': 2123, '年龄': 9, '数量': 3245 },
          { '日期': '1-5', '余额': 4103, '年龄': 12, '数量': 4355 },
          { '日期': '1-6', '余额': 7123, '年龄': 10, '数量': 3567 }
        ],
        '广州': [
          { '日期': '1-1', '余额': 123, '年龄': 3, '数量': 1244 },
          { '日期': '1-2', '余额': 1223, '年龄': 6, '数量': 2344 },
          { '日期': '1-3', '余额': 2123, '年龄': 30, '数量': 3245 },
          { '日期': '1-5', '余额': 4123, '年龄': 12, '数量': 4355 },
          { '日期': '1-4', '余额': 5123, '年龄': 18, '数量': 4564 },
          { '日期': '1-6', '余额': 3843, '年龄': 30, '数量': 4850 }
        ]
      }
    }
    this.chartSettings = {}
  },
  components: { VeScatter }
}
</script>
