export default {
  name: '雷达图',
  type: 'radar',
  data: [
    {
      name: '简单雷达图',
      data: {
        columns: ['城市', '房价', '收入', '人口比例'],
        rows: [
          { '房价': 10000, '收入': 4000, '人口比例': 0.4, '城市': '北京' },
          { '房价': 20000, '收入': 6000, '人口比例': 0.6, '城市': '上海' },
          { '房价': 30000, '收入': 8000, '人口比例': 0.2, '城市': '广州' }
        ]
      },
      settings: {
        dataType: {
          '人口比例': 'percent'
        }
      }
    },
    {
      name: '指标维度配置',
      data: {
        columns: ['城市', '房价', '收入', '人口比例'],
        rows: [
          { '房价': 10000, '收入': 4000, '人口比例': 0.4, '城市': '北京' },
          { '房价': 20000, '收入': 6000, '人口比例': 0.6, '城市': '上海' },
          { '房价': 30000, '收入': 8000, '人口比例': 0.2, '城市': '广州' }
        ]
      },
      settings: {
        dataType: {
          '人口比例': 'percent'
        },
        dimension: '城市',
        metrics: ['收入', '人口比例', '房价']
      }
    },
    {
      name: '样式配置',
      data: {
        columns: ['城市', '房价', '收入', '人口比例'],
        rows: [
          { '房价': 10000, '收入': 4000, '人口比例': 0.4, '城市': '北京' },
          { '房价': 20000, '收入': 6000, '人口比例': 0.6, '城市': '上海' },
          { '房价': 30000, '收入': 8000, '人口比例': 0.2, '城市': '广州' }
        ]
      },
      settings: {
        label: {
          normal: {
            color: 'red',
            show: true
          }
        }
      }
    }
  ]
}
