export default {
  name: '散点图',
  type: 'scatter',
  data: [
    {
      data: [
        { '年份': 1991, '人均寿命': 57, 'GDP': 3000, name: '中国' },
        { '年份': 1992, '人均寿命': 65, 'GDP': 4000, name: '中国' },
        { '年份': 1993, '人均寿命': 76, 'GDP': 8000, name: '中国' },
        { '年份': 1991, '人均寿命': 37, 'GDP': 5050, name: '美国' },
        { '年份': 1992, '人均寿命': 25, 'GDP': 2050, name: '美国' },
        { '年份': 1993, '人均寿命': 40, 'GDP': 6570, name: '美国' },
        { '年份': 1991, '人均寿命': 48, 'GDP': 3000, name: '俄罗斯' },
        { '年份': 1992, '人均寿命': 27, 'GDP': 6360, name: '俄罗斯' },
        { '年份': 1993, '人均寿命': 17, 'GDP': 3430, name: '俄罗斯' }
      ],
      settings: {
        dataType: ['normal', 'normal', 'KMB'],
        axisNames: ['年份', '人均寿命', 'GDP']
      }
    }
  ]
}
